-- Create an index on the USER table to improve query performance
CREATE INDEX IDX_User_Role_Type ON [dbo].[USER] ([Role_Type]);

INSERT INTO [dbo].[USER] (
    [ID],
    [Name],
    [Birthdate],
    [Address],
    [Phone_Number],
    [Role_Type],
    [Username],
    [Password],
    [Email],
    [Permission]
)
VALUES (
    1063940,
    N'Κληρίδης Χριστόδουλος - Γλαύκος',
    '2002-10-11', -- Use ISO format YYYY-MM-DD
    N'Αργυρωκάστρου 5, Στρόβολος, Λευκωσία, 2064',
    N'+35799643634',
    N'Physical',
    N'ccleri02',
    N'Xgk!cs2002',
    N'christodoulosclerides@gmail.com',
    N'ΦΥ'
);

INSERT INTO [dbo].[APPLICATION] ([DATE], [ID], [CATEGORY_NUMBER], [Status]) 
VALUES ('2025-01-01', 1063940, N'Γ1', N'Pending for Review');

INSERT INTO [dbo].[APPLICATION] ([DATE], [ID], [CATEGORY_NUMBER], [Status]) 
VALUES ('2025-01-02', 1063940, N'Γ2', N'Pending for Review');

INSERT INTO [dbo].[APPLICATION] ([DATE], [ID], [CATEGORY_NUMBER], [Status]) 
VALUES ('2025-01-03', 1063940, N'Γ14', N'Pending for Review');

INSERT INTO [dbo].[APPLICATION] ([DATE], [ID], [CATEGORY_NUMBER], [Status]) 
VALUES ('2025-01-04', 1063940, N'Γ5', N'Pending for Review');

INSERT INTO [dbo].[APPLICATION] ([DATE], [ID], [CATEGORY_NUMBER], [Status]) 
VALUES ('2025-01-05', 1063940, N'Γ1', N'Pending for Review');

INSERT INTO [dbo].[SUBSITY_CATEGORIES] ([CATEGORY_NUMBER], [DESCRIPTION], [AMOUNT], [AVAILABLE_SUBSITY_NUMBER])
VALUES
(N'Γ1', N'Απόσυρση και αντικατάσταση με καινούργιο όχημα ιδιωτικής χρήσης χαμηλών εκπομπών CO2 (μέχρι 50 γρ/χλμ)', 7500.00, 1228),
(N'Γ2', N'Απόσυρση και αντικατάσταση με καινούργιο όχημα ταξί χαμηλών εκπομπών CO2 (μέχρι 50 γρ/χλμ)', 12000.00, 30),
(N'Γ3', N'Απόσυρση και αντικατάσταση με καινούργιο όχημα χαμηλών εκπομπών CO2 (μέχρι 50 γρ/χλμ) για δικαιούχο αναπηρικού οχήματος', 15000.00, 30),
(N'Γ4', N'Απόσυρση και αντικατάσταση με καινούργιο όχημα χαμηλών εκπομπών CO2 (μέχρι 50 γρ/χλμ) πολύτεκνης οικογένειας', 15000.00, 30),
(N'Γ5', N'Χορηγία για αγορά καινούργιου οχήματος ιδιωτικής χρήσης μηδενικών εκπομπών CO2', 9000.00, 1827),
(N'Γ6', N'Χορηγία για αγορά καινούργιου οχήματος ταξί μηδενικών εκπομπών CO2', 20000.00, 60),
(N'Γ7', N'Χορηγία για αγορά καινούργιου οχήματος μηδενικών εκπομπών CO2 για δικαιούχο αναπηρικού οχήματος', 20000.00, 60),
(N'Γ8', N'Χορηγία για αγορά καινούργιου οχήματος μηδενικών εκπομπών CO2 πολύτεκνης οικογένειας', 20000.00, 60),
(N'Γ9', N'Χορηγία για αγορά μεταχειρισμένου οχήματος μηδενικών εκπομπών CO2', 9000.00, 104),
(N'Γ10', N'Χορηγία για αγορά καινούργιου ηλεκτρικού οχήματος της κατηγορίας Ν1 (οχήματα μικτού βάρους μέχρι 3.500 κιλά)', 15000.00, 185),
(N'Γ11', N'Χορηγία για αγορά καινούργιου ηλεκτρικού οχήματος της κατηγορίας Ν2 (οχήματα μικτού βάρους που δεν υπερβαίνει τα 3.500 κιλά αλλά δεν υπερβαίνει τα 12.000 κιλά)', 25000.00, 4),
(N'Γ12', N'Χορηγία για αγορά καινούργιου οχήματος κατηγορίας M2 μηδενικών εκπομπών CO2 (μικρό λεωφορείο το οποίο περιλαμβάνει περισσότερες από οκτώ θέσεις καθημένων πέραν του καθίσματος του οδηγού και έχει μέγιστη μάζα το πολύ 5 τόνους)', 40000.00, 2),
(N'Γ13', N'Χορηγία για αγορά καινούργιου οχήματος μηδενικών εκπομπών CO2 κατηγορίας L6e (υποκατηγορία «Β») και L7e (υποκατηγορία «C»)', 4000.00, 65),
(N'Γ14', N'Χορηγία για αγορά καινούργιου οχήματος μηδενικών εκπομπών CO2 κατηγορίας L (εξαιρουμένων των οχημάτων κατηγορίας L6e (υποκατηγορία «Β») και L7e (υποκατηγορία «Β και C»))', 1500.00, 893);